first_routes_and_controllers/app/controllers/user_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "little bobby tables"], ["email", "drop_database@jk.com"], ["created_at", "2019-06-17 22:51:17.546564"], ["updated_at", "2019-06-17 22:51:17.546564"]]
---
  def create
    user = User.create(name:params['name'])